function BMI(weight: number, height: number): string {
    // แปลงความสูงจากเซนติเมตรเป็นเมตร 
     const heightInMeters = height / 100
    
    // คำนวณ BMI
    const bmi = weight / (height * height)
    
    // ตรวจสอบค่า BMI และคืนค่าคำตอบที่เหมาะสม
    if (bmi < 18.50) {
        return 'อยู่ในเกณฑ์ น้ำหนักน้อย / ผอม ภาวะเสี่ยงต่อโรค มากกว่าคนปกติ'
    } else if (bmi >= 18.50 && bmi < 22.90) {
        return 'อยู่ในเกณฑ์ ปกติ(สุขภาพดี) ภาวะเสี่ยงต่อโรค เท่าคนปกติ'
    } else if (bmi >= 23 && bmi < 24.90) {
        return 'อยู่ในเกณฑ์ ท้วม / โรคอ้วนระดับ 1 ภาวะเสี่ยงต่อโรค อัตรายระดับ 1'
    } else if (bmi >= 25 && bmi < 29.90) {
        return 'อยู่ในเกณฑ์ อ้วน / โรคอ้วนระดับ 2 ภาวะเสี่ยงต่อโรค อัตรายระดับ 2'
    } else if (bmi >= 30) {
        return 'อยู่ในเกณฑ์ อ้วนมาก / โรคอ้วนระดับ 3 ภาวะเสี่ยงต่อโรค อัตรายระดับ 3'
    } else {
        return 'ค่าคำนวณ BMI ไม่ถูกต้อง'
    }
}

// ทดสอบฟังก์ชัน
console.log(BMI(70, 180))



